{
    "Trusted by 50K+ beauty lovers": "Fiable pour plus de 50 000 passionnés de beauté",
    "Glow": "Éclat",
    "Naturally": "Naturellement",
    "Discover routines that actually work. Explore trending videos, shop vetted products, and get personalized advice tailored to your skin type.": "Découvrez des routines qui fonctionnent vraiment. Explorez les vidéos tendance, achetez des produits vérifiés et recevez des conseils personnalisés adaptés à votre type de peau.",
    "Discover Your Glow": "Découvrez votre éclat",
    "Watch Stories": "Regarder les histoires",
    "Followers": "Abonnés",
    "Products Curated": "Produits sélectionnés",
    "Satisfaction": "Satisfaction",
    "Featured TikTok Clips": "Clips TikTok à la une",
    "The latest viral skincare trends everyone's talking about": "Les dernières tendances skincare virales dont tout le monde parle",
    "Creator name": "Nom du créateur",
    "2.3M views": "2,3 M de vues",
    "Trending Hashtags": "Hashtags tendance",
    "Join the conversation with beauty lovers worldwide": "Rejoignez la conversation avec les passionnés de beauté du monde entier",
    "videos": "vidéos",
    "Ready to Find Your Perfect Routine?": "Prêt à trouver votre routine parfaite ?",
    "Discover routines tailored to your lifestyle. From skincare and fitness to productivity and wellness, our tips and guides help you build habits that stick — making everyday life simpler, healthier, and more enjoyable. Start your journey today!": "Découvrez des routines adaptées à votre style de vie. De la skincare au fitness, en passant par la productivité et le bien-être, nos conseils vous aident à créer des habitudes durables — pour une vie plus simple, plus saine et plus agréable. Commencez votre voyage dès aujourd’hui !",
    "It only takes 2 minutes. No signup required.": "Cela ne prend que 2 minutes. Aucun compte requis.",


    "home": "maison",
    "DiodioGlow": "DiodioGlow",
    "DG": "DG",
    "Curating viral skincare trends and AI-powered product recommendations for natural, glowing skin.": "Sélection des tendances virales en matière de soins de la peau et recommandations de produits basées sur l'IA pour une peau naturellement éclatante.",
    "Explore": "Explorer",
    "Videos": "Videsos",
    "Products": "Produits",
    "Connect" : "Connecter",
    "Instagram" : "Instagram",
    "Legal" : "Légale",
    "Privacy Policy" : "politique de confidentialité",
    "Terms of Service" : "Conditions d'utilisation",
    "Affiliate Disclosure" : "Divulgation des affiliés",
     "Support" : "Soutien",

     "Video Feed": "Flux de vidéos",
     "Blog": "Blog",
     "About" : "propos",
     "Toggle menu": "Basculer le menu",
     "Home": "Maison",
     "Profile" : "Profil",
     "Messages": "Messages",
     "Settings" : "Paramètres",
     "Billing" : "Facturation",
     "Logout" : "Deconnexion",
     "Login" : "Connexion",
     "Register" : "S'inscrire",


     "Curated Products": "Produits curatifs",
     "All products handpicked by Diodio Glow • Shop from trusted affiliate stores": "Tous les produits sont sélectionnés avec soin par Diodio Glow • Achetez auprès de nos partenaires de confiance",
      "Essences": "Essences",
      "Dry": "Sec",
      "Trending skincare routines and beauty tips from TikTok": "Les routines de soins de la peau et les astuces beauté tendance de TikTok",
      "Share": "Partager",
      "Recovery codes let you regain access if you lose your 2FA device. Store them in a secure password manager.": "Les codes de restauration vous permettent de reprendre accès si vous perdez votre dispositif 2FA. Les stockez dans un gestionnaire de mots de passe securis.",
      "2FA Recovery Codes": "Codes de restauration 2FA",
      "View Recovery Codes": "Voir les codes de restauration",
      "Hide Recovery Codes": "Masquer les codes de restauration",
      "Regenerate Codes" : "Regenerez les codes",
      "Each recovery code can be used once to access your account and will be removed after use. If you need more, click Regenerate Codes above.": "Chaque code de récupération est à usage unique et sera supprimé après utilisation. Si vous avez besoin de codes supplémentaires, cliquez sur « Régénérer les codes » ci-dessus.",
       "Light": "Lumiere",
       "Dark": "Sombre",
       "System": "Système",

       "Delete account": "Supprimer le compte",
        "Delete your account and all of its resources" : "Supprimez votre compte et toutes ses ressources",
        "Are you sure you want to delete your account?": "Êtes-vous sûr de vouloir supprimer votre compte ?",
        "Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "Une fois votre compte supprimé, toutes ses ressources et données seront définitivement effacées. Veuillez saisir votre mot de passe pour confirmer la suppression définitive de votre compte.",
        "Cancel": "Annuler",
        "Save": "Sauvegarder",



        "Your email address is unverified.": "Votre adresse courriel n'est pas vérifiée.",
        "Click here to re-send the verification email.": "Click here to re-send the verification email.",
        "A new verification link has been sent to your email address.": "Un nouveau lien de vérification a été envoyé à votre adresse électronique.",
        "Saved.": "Sauvegardé.",
        "Enabled": "Activé",
        "With two-factor authentication enabled, you will be prompted for a secure, random pin during login, which you can retrieve from the TOTP-supported application on your phone.": "Lorsque l'authentification à deux facteurs est activée, un code PIN sécurisé et aléatoire vous sera demandé lors de la connexion. Vous pourrez le récupérer depuis l'application compatible TOTP sur votre téléphone.",
        "Disable 2FA": "Désactiver 2FA",
        "Disabled": "Desactivé",
        "When you enable two-factor authentication, you will be prompted for a secure pin during login. This pin can be retrieved from a TOTP-supported application on your phone.": "Lorsque vous activez l'authentification à deux facteurs, un code PIN sécurisé vous sera demandé lors de la connexion. Ce code PIN peut être récupéré depuis une application compatible TOTP installée sur votre téléphone.",
        "Enable 2FA": "Activer 2FA",
        "or, enter the code manually": "ou, entrez le code manuellement",
        "Trending Routines:": "Routines tendances:",
        "1. The “Glass Skin” Routine": "1. La routine “Skin de verre”,",
        "Originating from Korean beauty, the glass skin trend is all about achieving a complexion that’s smooth, clear, and luminous—just like glass.": "Issue de la beauté coréenne, la tendance du teint de verre vise à obtenir un teint lisse, clair et lumineux, comme du verre.",
        "How it works:": "Comment cela fonctionne:",
        "Double cleanse to remove every trace of dirt and makeup.": "Double nettoyage pour retirer toutes les traces de poussiere et de maquillage.",
        "Apply hydrating toners and serums (look for hyaluronic acid).": "Appliquer des toners hydratants et des serums (rechercher l'acide hyaluronique).",
        "Seal it all in with a lightweight moisturizer and sunscreen.": "Encapsuler tout en utilisant un hydratant leger et un sunscreen.",
        "Why it’s trending:": "Pourquoi cela est tendance:",
        "It delivers that natural, dewy glow everyone’s chasing—no filters needed.": "Il offre un brillant lueur naturelle et douce que tout le monde cherche, sans filtres.",
        "The beauty world is flooded with new products every week—serums that promise a glow-up overnight, moisturizers that claim 72-hour hydration, and toners that “transform” your skin...": "Le monde de la beauté est rempli de nouveaux produits tous les jours—serums promettant une brillance nocturne, hydratants promettant 72 heures d'hydratation et toners transformant votre peau...",
        "Tips & Guides:": "Guides et conseils:",
        "Product Reviews:": "Avis sur les produits:",
        "In our fast-paced world, having access to the right advice can make all the difference. Whether it’s mastering a new skill, optimizing your daily routine, or navigating technology, practical tips and comprehensive guides can help you save time, avoid mistakes, and achieve your goals faster. In this blog, we’ll explore the essence of effective tips and guides and share some actionable strategies you can implement today.": "Dans notre monde trépidant, avoir accès aux bons conseils peut faire toute la différence. Qu'il s'agisse de maîtriser une nouvelle compétence, d'optimiser votre quotidien ou de vous familiariser avec les nouvelles technologies, des conseils pratiques et des guides complets peuvent vous aider à gagner du temps, à éviter les erreurs et à atteindre vos objectifs plus rapidement. Dans cet article, nous explorerons l'essence même des conseils et guides efficaces et partagerons des stratégies concrètes que vous pouvez mettre en œuvre dès aujourd'hui.",
        "About the Founder:": "A propos du fondateur:",
        "Meet Diodio Glow": "Rencontrez Diodio Glow",
        "Diodio Glow is one of Senegals most popular skincare and beauty influencers, with a passionate community of 50K+ followers who trust her recommendations.": "Diodio Glow est l'un des influencers de la beauté et du soin de Senegal les plus populaires, avec une communauté passionnée de 50K+ abonnées qui confient ses recommandations.",
        "From viral TikTok routines to honest product reviews, she's dedicated to helping women discover their natural glow. Her approach is authentic, affordable, and rooted in celebrating the beauty of diverse African skin.": "Des routines TikTok virales aux avis honnêtes sur les produits, elle se consacre à aider les femmes à révéler leur éclat naturel. Son approche est authentique, accessible et célèbre la beauté de la diversité des peaux africaines.",
        "This platform brings together her favorite skincare finds, trending routines, and AI-powered personalized recommendations—everything you need to build a routine that works for YOUR skin.": "Cette plateforme rassemble ses produits de soin préférés, les routines tendance et des recommandations personnalisées basées sur l'IA — tout ce dont vous avez besoin pour créer une routine adaptée à VOTRE peau.",
        "50K+ followers across TikTok, Instagram & YouTube": "50K+ followers across TikTok, Instagram & YouTube",
        "100+ curated products handpicked for quality and affordability": "100+ produits curateurs choisis pour la qualité et l'accessibilité",
        "95% satisfaction rate from product recommendations": "95% de satisfait des recommandations de produits",
        "Connect with Diodio Glow": "Connectez-vous avec Diodio Glow",
        "Collaboration inquiries?": "Demandes de collaboration ?",
        "Email us for partnership opportunities.": "Envoyez-nous un email pour des opportunités de partenariat.",
        "Our Mission": "Notre mission",
        "Every product, every video, every recommendation is rooted in authenticity and the belief that beautiful skin starts with understanding YOUR unique needs.": "Tous les produits, toutes les videos, toutes les recommandations sont basées sur l'authenticité et la conviction que la beauté commence avec la comprendre VOTRE besoin unique."

    }
